# LoadNature Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadNature Class
Members See Also
---
An object that represents a load nature.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LoadNature : Element
```

Visual Basic
---
```text
Public Class LoadNature _
	Inherits Element
```

Visual C++
---
```text
public ref class LoadNature : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..LoadNature
# See Also
LoadNature Members
Autodesk.Revit.DB.Structure Namespace